<?php
       return [
       
           'accepted' => 'يجب قبول حقل .',
           'accepted_if' => 'يجب قبول حقل  عندما :other يكون :value.',
           'active_url' => 'حقل  يجب أن يكون رابط صحيح.',
           'after' => 'يجب أن يكون حقل  تاريخًا بعد :date.',
           'after_or_equal' => 'يجب أن يكون حقل  تاريخًا بعد أو يساوي :date.',
           'alpha' => 'يجب أن يحتوي حقل  على أحرف فقط.',
           'alpha_dash' => 'يجب أن يحتوي حقل  على أحرف، أرقام، شرطات وشرطات سفلية فقط.',
           'alpha_num' => 'يجب أن يحتوي حقل  على أحرف وأرقام فقط.',
           'array' => 'يجب أن يكون حقل  مصفوفة.',
           'ascii' => 'يجب أن يحتوي حقل  على أحرف أبجدية وأرقام فقط.',
           'before' => 'يجب أن يكون حقل  تاريخًا قبل :date.',
           'before_or_equal' => 'يجب أن يكون حقل  تاريخًا قبل أو يساوي :date.',
           'between' => [
               'array' => 'يجب أن يحتوي حقل  على بين :min و :max عنصر.',
               'file' => 'يجب أن يكون الملف  بين :min و :max كيلوبايت.',
               'numeric' => 'يجب أن يكون حقل  بين :min و :max.',
               'string' => 'يجب أن يكون حقل  بين :min و :max حرف.',
           ],
           'boolean' => 'يجب أن يكون حقل  صحيح أو خاطئ.',
           'can' => 'يحتوي حقل  على قيمة غير مسموح بها.',
           'confirmed' => 'تأكيد حقل  غير متطابق.',
           'current_password' => 'كلمة المرور غير صحيحة.',
           'date' => 'يجب أن يكون حقل  تاريخًا صحيحًا.',
           'date_equals' => 'يجب أن يكون حقل  تاريخًا يساوي :date.',
           'date_format' => 'يجب أن يكون حقل  بالتنسيق :format.',
           'decimal' => 'يجب أن يحتوي حقل  على :decimal عشرية.',
           'declined' => 'يجب رفض حقل .',
           'declined_if' => 'يجب رفض حقل  عندما :other يكون :value.',
           'different' => 'يجب أن يكون حقل  مختلفًا عن :other.',
           'digits' => 'يجب أن يحتوي حقل  على :digits أرقام.',
           'digits_between' => 'يجب أن يحتوي حقل  بين :min و :max أرقام.',
           'dimensions' => 'حقل  يحتوي على أبعاد صورة غير صالحة.',
           'distinct' => 'حقل  يحتوي على قيمة مكررة.',
           'doesnt_end_with' => 'يجب أن لا ينتهي حقل  بأحد القيم التالية: :values.',
           'doesnt_start_with' => 'يجب أن لا يبدأ حقل  بأحد القيم التالية: :values.',
           'email' => 'يجب أن يكون حقل  عنوان بريد إلكتروني صالح.',
           'ends_with' => 'يجب أن ينتهي حقل  بأحد القيم التالية: :values.',
           'enum' => 'القيمة المحددة غير صالحة.',
           'exists' => 'القيمة المحددة غير صالحة.',
           'file' => 'يجب أن يكون  ملفًا.',
           'filled' => 'يجب أن يحتوي حقل  على قيمة.',
           'gt' => [
               'array' => 'يجب أن يحتوي حقل  على أكثر من :value عنصر.',
               'file' => 'يجب أن يكون الملف  أكبر من :value كيلوبايت.',
               'numeric' => 'يجب أن يكون حقل  أكبر من :value.',
               'string' => 'يجب أن يكون حقل  أكبر من :value حرفًا.',
           ],
           'gte' => [
               'array' => 'يجب أن يحتوي حقل  على :value عنصر أو أكثر.',
               'file' => 'يجب أن يكون الملف  أكبر من أو يساوي :value كيلوبايت.',
               'numeric' => 'يجب أن يكون حقل  أكبر من أو يساوي :value.',
               'string' => 'يجب أن يكون حقل  أكبر من أو يساوي :value حرفًا.',
           ],
           'image' => 'يجب أن يكون حقل  صورة.',
           'in' => 'القيمة المحددة غير صالحة.',
           'in_array' => 'حقل  يجب أن يكون موجودًا في :other.',
           'integer' => 'يجب أن يكون حقل  عددًا صحيحًا.',
           'ip' => 'يجب أن يكون حقل  عنوان IP صالحا.',
           'ipv4' => 'يجب أن يكون حقل  عنوان IPv4 صالحًا.',
           'ipv6' => 'يجب أن يكون حقل  عنوان IPv6 صالحًا.',
           'json' => 'يجب أن يكون حقل  نص JSON صالحًا.',
           'lowercase' => 'يجب أن يكون حقل  حروفًا صغيرة.',
           'lt' => [
               'array' => 'يجب أن يحتوي حقل  على أقل من :value عنصر.',
               'file' => 'يجب أن يكون الملف  أقل من :value كيلوبايت.',
               'numeric' => 'يجب أن يكون حقل  أقل من :value.',
               'string' => 'يجب أن يكون حقل  أقل من :value حرف.',
           ],
           'lte' => [
               'array' => 'يجب أن لا يحتوي حقل  على أكثر من :value عنصر.',
               'file' => 'يجب أن يكون الملف  أقل من أو يساوي :value كيلوبايت.',
               'numeric' => 'يجب أن يكون حقل  أقل من أو يساوي :value.',
               'string' => 'يجب أن يكون حقل  أقل من أو يساوي :value حرف.',
           ],
           'mac_address' => 'يجب أن يكون حقل  عنوان MAC صالحًا.',
           'max' => [
               'array' => 'يجب ألا يحتوي حقل  على أكثر من :max عنصر.',
               'file' => 'يجب ألا يكون الملف  أكبر من :max كيلوبايت.',
               'numeric' => 'يجب ألا يكون حقل  أكبر من :max.',
               'string' => 'يجب ألا يكون حقل  أكبر من :max حرف.',
           ],
           'max_digits' => 'يجب ألا يحتوي حقل  على أكثر من :max رقمًا.',
           'mimes' => 'يجب أن يكون حقل  ملفًا من النوع: :values.',
           'mimetypes' => 'يجب أن يكون حقل  ملفًا من النوع: :values.',
           'min' => [
               'array' => 'يجب أن يحتوي حقل  على الأقل على :min عنصر.',
               'file' => 'يجب أن يكون الملف  على الأقل :min كيلوبايت.',
               'numeric' => 'يجب أن يكون حقل  على الأقل :min.',
               'string' => 'يجب أن يكون حقل  على الأقل :min حرف.',
           ],
           'min_digits' => 'يجب أن يحتوي حقل  على الأقل على :min رقمًا.',
           'missing' => 'يجب أن يكون حقل  مفقودًا.',
           'missing_if' => 'يجب أن يكون حقل  مفقودًا عندما :other يكون :value.',
           'missing_unless' => 'يجب أن يكون حقل  مفقودًا ما لم يكن :other هو :value.',
           'missing_with' => 'يجب أن يكون حقل  مفقودًا عندما يكون :values موجودًا.',
           'missing_with_all' => 'يجب أن يكون حقل  مفقودًا عندما تكون :values موجودة.',
           'multiple_of' => 'يجب أن يكون حقل  مضاعفًا للقيمة :value.',
           'not_in' => 'القيمة المحددة غير صالحة.',
           'not_regex' => 'صيغة  غير صالحة.',
           'numeric' => 'يجب أن يكون حقل  رقمًا.',
           'password' => [
               'letters' => 'يجب أن يحتوي حقل  على حرف واحد على الأقل.',
               'mixed' => 'يجب أن يحتوي حقل  على حرف كبير وحرف صغير على الأقل.',
               'numbers' => 'يجب أن يحتوي حقل  على رقم واحد على الأقل.',
               'symbols' => 'يجب أن يحتوي حقل  على رمز واحد على الأقل.',
               'uncompromised' => 'القيمة المعطاة ظهرت في تسريب بيانات. يرجى اختيار قيمة مختلفة.',
           ],
           'present' => 'يجب أن يكون حقل  موجودًا.',
           'prohibited' => 'حقل  ممنوع.',
           'prohibited_if' => 'حقل  ممنوع عندما :other يكون :value.',
           'prohibited_unless' => 'حقل  ممنوع ما لم :other يكون في :values.',
           'prohibits' => 'حقل  يمنع :other من التواجد.',
           'regex' => 'صيغة حقل  غير صالحة.',
           'required' => 'مطلوب',
           'required_array_keys' => 'يجب أن يحتوي حقل  على مدخلات للقيم: :values.',
           'required_if' => 'يجب أن يكون حقل  مطلوبًا عندما يكون :other هو :value.',
           'required_if_accepted' => 'يجب أن يكون حقل  مطلوبًا عند قبول :other.',
           'required_unless' => 'يجب أن يكون حقل  مطلوبًا ما لم :other يكون في :values.',
           'required_with' => 'يجب أن يكون حقل  مطلوبًا عندما تكون :values موجودة.',
           'required_with_all' => 'يجب أن يكون حقل  مطلوبًا عندما تكون :values موجودة.',
           'required_without' => 'يجب أن يكون حقل  مطلوبًا عندما لا تكون :values موجودة.',
           'required_without_all' => 'يجب أن يكون حقل  مطلوبًا عندما لا تكون :values موجودة.',
           'same' => 'يجب أن يتطابق حقل  مع :other.',
           'size' => [
               'array' => 'يجب أن يحتوي حقل  على :size عنصر.',
               'file' => 'يجب أن يكون حقل  :size كيلوبايت.',
               'numeric' => 'يجب أن يكون حقل  :size.',
               'string' => 'يجب أن يكون حقل  :size حرف.',
           ],
           'starts_with' => 'يجب أن يبدأ حقل  بأحد القيم التالية: :values.',
           'string' => 'يجب أن يكون حقل  نصًا.',
           'timezone' => 'يجب أن يكون حقل  منطقة زمنية صالحة.',
           'unique' => 'موجود بالفعل.',
           'uploaded' => 'فشل تحميل حقل .',
           'uppercase' => 'يجب أن يكون حقل  حروف كبيرة.',
           'url' => 'يجب أن يكون حقل  رابطًا صحيحًا.',
           'ulid' => 'يجب أن يكون حقل  ULID صالحًا.',
           'uuid' => 'يجب أن يكون حقل  UUID صالحًا.',
       
           /*
           |--------------------------------------------------------------------------
           | Custom Validation Language Lines
           |--------------------------------------------------------------------------
           |
           | Here you may specify custom validation messages for attributes using the
           | convention "attribute.rule" to name the lines. This makes it quick to
           | specify a specific custom language line for a given attribute rule.
           |
           */
       
           'custom' => [
               'attribute-name' => [
                   'rule-name' => 'custom-message',
               ],
           ],
       
           /*
           |--------------------------------------------------------------------------
           | Custom Validation Attributes
           |--------------------------------------------------------------------------
           |
           | The following language lines are used to swap our attribute placeholder
           | with something more reader friendly such as "E-Mail Address" instead
           | of "email". This simply helps us make our message more expressive.
           |
           */
       
           'attributes' => [],
       
       ];

    
    